# 运算符  算术运算符  比较运算符  逻辑运算符  赋值运算符
# 成员运算符  in    not in
sheet = ['张三', '李四', '王五']  #序列
if '张三' in sheet:
    print('在')
else:
    print('不在')
# 身份运算符  is    is not 引用
a = 5
b = a
c = 5.0
print(a is b)
print(a == c)  #数值比较
print(a is c)  #内存地址比较

# 位运算符
# 二进制  0 1  逢二进一  借一当二
# 二转十规则：从右到左用每位数乘以2的N次方（0开始）后累加
# 1101 转为十进制
# 1*2^0=1
# 0*2^1=0
# 1*2^2=4
# 1*2^3=8
# 1 + 0 + 4 + 8 = 13
# 十转二规则：用十进制对2取余，将余数放在二进制左侧
# 8 转为 二进制
# 8/2=4 0
# 4/2=2 0
# 2/2=1 0
# 1/2=0 1
# 转为 二进制 1000

a = 60  # 00111100
b = 13  # 00001101
c = 0
c = a & b   # 00001100
print(c)
d = a | b  # 00111101
print(d)
e = ~a # 取反左侧第一位是1代表负数 0代表正数 11000011
# 11000011   -（~11000011+1）  -00111101
print(e)
f = a << 3  #00111100000
g = a >> 3  #00000111
print(f)
print(g)